# R에서 지원하는 색깔은 657개이다.
length(colors())
colors()

# rep() : repeat함수
rep(1:4, 2)  #1~4까지 2번 반복 결과값 : 12341234
rep(1:4, each=2)  #1~4까지 각각 2개씩 반복 : 11223344
rep(1:4, c(1,2,3,4))  # 1~4까지 c벡터 만큼 반복 : 1223334444
rep(1:4, each=2, len=4)  # 1~4까지 각각 2개씩 반복 but 4개까지 : 1122

x <- c(1, rep(6,2), rep(7,5), 4, 2) # 순서대로 숫자 저장
x # 1667777742
x <- table(c(1, rep(6,2), rep(7,5), 4, 2))  # 순서대로 숫자 저장
x # 숫자가 각각 갯수만큼 찍힘
# 1 2 4 6 7
# 1 1 1 2 5

# 16진수로 바그래프 표시
barplot(x, col="#F6C2F4")
barplot(x, col=rgb(246,194,244, max=255))
barplot(x, col=hsv(0.83,0.21,0.96))
barplot(x, col="Plum 1")
